app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Title from ui"], ["description", "Description from ui"], ["created_at", "2019-02-21 18:54:08.692553"], ["updated_at", "2019-02-21 18:54:08.692553"]]
---
  def create
    @article = Article.new(article_params);
    if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "Description from ui edit\r\n"], ["updated_at", "2019-02-21 20:03:12.590658"], ["id", 9]]
---
  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)